{
  "architectures": [
    "RobertaModel"
  ],
  "max_position_embeddings": 514,
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.3,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-05,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "type_vocab_size": 1,
  "vocab_size": 50265,
  "id2label": {
	  "0": "Safe", 
	  "1": "Unsafe"
  },
  "label2id": {
	  "Safe": 0, 
	  "Unsafe": 1
  }
}
